<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7e35f30a41466e5c82aa18fc3b1c5c771ac29d9f6ae6da4d0ab7a141bfa25fa8","plan_job_ref":"Job Create terraform plan #22 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6672899061","plan_hash":"0cadfcb3ceb044a825b89555e425456c4c0cf0b27d5326ebe228ad8f8e786cde","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/971ab2d5e1668534deee7f467dd1e079d08cb7a0ebd76de69675dedb9694796b.zip" -> "builds/afe1cd16fee2c509ddbe72a02125e21e667c1ec6786f11a83a8ae1511664b57a.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-22T01:40:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:14/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/afe1cd16fee2c509ddbe72a02125e21e667c1ec6786f11a83a8ae1511664b57a.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/afe1cd16fee2c509ddbe72a02125e21e667c1ec6786f11a83a8ae1511664b57a.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/971ab2d5e1668534deee7f467dd1e079d08cb7a0ebd76de69675dedb9694796b.zip" -> "builds/afe1cd16fee2c509ddbe72a02125e21e667c1ec6786f11a83a8ae1511664b57a.zip"
          ~ "timestamp" = "1697938791248843000" -> "1698446320706312000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #22](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6672899061)